## 🧾 Terraform Plan for `gov_scp`

> ⚠️ Review this carefully before applying changes

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.gov_scp_advanced.aws_organizations_policy.scp["deny-cloudshell"] will be created
  + resource "aws_organizations_policy" "scp" {
      + arn         = (known after apply)
      + content     = jsonencode({})
      + description = "Prevent CloudShell"
      + id          = (known after apply)
      + name        = "deny-cloudshell"
      + tags_all    = (known after apply)
      + type        = "SERVICE_CONTROL_POLICY"
    }

  # module.gov_scp_advanced.aws_organizations_policy.scp["deny-ec2"] will be created
  + resource "aws_organizations_policy" "scp" {
      + arn         = (known after apply)
      + content     = jsonencode({})
      + description = "Deny EC2 usage"
      + id          = (known after apply)
      + name        = "deny-ec2"
      + tags        = {
          + "ManagedBy" = "Terraform"
        }
      + tags_all    = {
          + "ManagedBy" = "Terraform"
        }
      + type        = "SERVICE_CONTROL_POLICY"
    }

  # module.gov_scp_advanced.aws_organizations_policy_attachment.attachments["deny-cloudshell-ou-abc2-87654321"] will be created
  + resource "aws_organizations_policy_attachment" "attachments" {
      + id        = (known after apply)
      + policy_id = (known after apply)
      + target_id = "ou-abc2-87654321"
    }

  # module.gov_scp_advanced.aws_organizations_policy_attachment.attachments["deny-ec2-ou-abc1-12345678"] will be created
  + resource "aws_organizations_policy_attachment" "attachments" {
      + id        = (known after apply)
      + policy_id = (known after apply)
      + target_id = "ou-abc1-12345678"
    }

  # module.gov_scp_advanced_full.aws_organizations_policy.scp["deny-cloudshell"] will be created
  + resource "aws_organizations_policy" "scp" {
      + arn         = (known after apply)
      + content     = jsonencode({})
      + description = "Block AWS CloudShell usage"
      + id          = (known after apply)
      + name        = "deny-cloudshell"
      + tags        = {
          + "Environment" = "prod"
          + "Owner"       = "security"
        }
      + tags_all    = {
          + "Environment" = "prod"
          + "Owner"       = "security"
        }
      + type        = "SERVICE_CONTROL_POLICY"
    }

  # module.gov_scp_advanced_full.aws_organizations_policy.scp["deny-ec2"] will be created
  + resource "aws_organizations_policy" "scp" {
      + arn         = (known after apply)
      + content     = jsonencode({})
      + description = "Deny EC2 access"
      + id          = (known after apply)
      + name        = "deny-ec2"
      + tags        = {
          + "Environment" = "dev"
          + "Owner"       = "cloud-team"
        }
      + tags_all    = {
          + "Environment" = "dev"
          + "Owner"       = "cloud-team"
        }
      + type        = "SERVICE_CONTROL_POLICY"
    }

  # module.gov_scp_advanced_full.aws_organizations_policy_attachment.attachments["deny-cloudshell-ou-prod1-87654321"] will be created
  + resource "aws_organizations_policy_attachment" "attachments" {
      + id        = (known after apply)
      + policy_id = (known after apply)
      + target_id = "ou-prod1-87654321"
    }

  # module.gov_scp_advanced_full.aws_organizations_policy_attachment.attachments["deny-ec2-ou-dev1-12345678"] will be created
  + resource "aws_organizations_policy_attachment" "attachments" {
      + id        = (known after apply)
      + policy_id = (known after apply)
      + target_id = "ou-dev1-12345678"
    }

  # module.gov_scp_basic.aws_organizations_policy.scp["deny-root-actions"] will be created
  + resource "aws_organizations_policy" "scp" {
      + arn         = (known after apply)
      + content     = jsonencode({})
      + description = "Prevent use of root user"
      + id          = (known after apply)
      + name        = "deny-root-actions"
      + tags_all    = (known after apply)
      + type        = "SERVICE_CONTROL_POLICY"
    }

  # module.gov_scp_basic.aws_organizations_policy_attachment.attachments["deny-root-actions-ou-xyz1-abc12345"] will be created
  + resource "aws_organizations_policy_attachment" "attachments" {
      + id        = (known after apply)
      + policy_id = (known after apply)
      + target_id = "ou-xyz1-abc12345"
    }

Plan: 10 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with provider["registry.terraform.io/hashicorp/aws"],
  on providers.tf line 7, in provider "aws":
   7:   s3_force_path_style         = true

Use s3_use_path_style instead.

(and one more similar warning elsewhere)

Warning: Attribute Deprecated

  with provider["registry.terraform.io/hashicorp/aws"],
  on providers.tf line 7, in provider "aws":
   7:   s3_force_path_style         = true

Use s3_use_path_style instead.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

<!-- Sticky Pull Request Comment -->